package SWEA.모의역량테스트;


public class Solution_SWEA_4012_요리사_김한주 {

	
	public static void main(String[] args) {
		
//		 음식제공할때 최대한 비슷한 맛의 음식을 내야함
//		 N개의 식제료
//		 N/2씩 나누어 요리를 할때(N은 짝수)
//		 각각 음식 A, B라고 할 때 A와 B의 맛의 차이가 최소가 되도록 재료를 분배
//		식재료 i는 식재료 j와 같이 요리하게 되면 궁합이 잘 맞아 시너지 Sij가 발생한다. (1 ≤ i ≤ N, 1 ≤ j ≤ N, i ≠ j)
//		각 음식의 맛은 음식을 구성하는 식재료들로부터 발생하는 시너지 Sij들의 합이다.
//		식재료 i를 식재료 j와 같이 요리하게 되면 발생하는 시너지 Sij의 정보가 주어지고, 
//		가지고 있는 식재료를 이용해 A음식과 B음식을 만들 때, 
//		두 음식 간의 맛의 차이가 최소가 되는 경우를 찾고 그 최솟값을 정답으로 출력하는 프로그램을 작성하라.
		
		
		
		
	} // end of main
	
} // end of class
